Revit 2024 API
ImportIFCOptions Class
 Provides access to settings that control linking and opening IFC files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class ImportIFCOptions : IDisposable
Visual Basic
Public Class ImportIFCOptions _
	Implements IDisposable
Visual C++
public ref class ImportIFCOptions : IDisposable
Remarks
 These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ImportIFCOptions
See Also
ImportIFCOptions Members
Autodesk.Revit.DB Namespace